Revit 2024 API
SelectionFilterElement.AddSingle Method
 Adds a single ElementId to the filter's set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void AddSingle(
	ElementId id
)
Visual Basic
Public Sub AddSingle ( _
	id As ElementId _
)
Visual C++
public:
void AddSingle(
	ElementId^ id
)
Parameters
id
Type: Autodesk.Revit.DB.ElementId
 The ElementId to add.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Invalid ElementId
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
SelectionFilterElement Class
Autodesk.Revit.DB Namespace